Repository: godigitaldz/sahla-backend
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appName
source: Sahla
ar: سهلة

# createTask
source: Create Ifrili Task
ar: إنشاء مهمة إفريلي
fr: Créer une tâche Ifrili

source: Describe your need
ar: اوصف حاجتك
fr: Décrivez votre besoin

source: Phone number
ar: رقم الهاتف
fr: Numéro de téléphone

source: Second phone (optional)
ar: هاتف ثاني (اختياري)
fr: Deuxième téléphone (optionnel)

source: Use second phone as primary
ar: استخدم الهاتف الثاني كرئيسي
fr: Utiliser le deuxième téléphone comme principal

source: Location purpose
ar: الغرض من الموقع
fr: Objectif de l'emplacement

source: Add another location
ar: إضافة موقع آخر
fr: Ajouter un autre emplacement

# added
source: Added: {count}
ar: تم إضافة: {count}
fr: Ajouté: {count}

source: Task Image (Optional)
ar: صورة المهمة (اختياري)
fr: Image de la tâche (Optionnel)

source: Add Image
ar: إضافة صورة
fr: Ajouter une image

source: Tap to select from gallery
ar: اضغط لاختيار من المعرض
fr: Appuyez pour sélectionner dans la galerie

source: Change Image
ar: تغيير الصورة
fr: Changer l'image

source: Remove
ar: إزالة
fr: Retirer

source: Uploading...
ar: جاري الرفع...
fr: Téléchargement...

source: Pick date & time
ar: اختر التاريخ والوقت
fr: Choisir la date et l'heure

# createTaskButton
source: Create Task
ar: إنشاء المهمة
fr: Créer une tâche

source: Creating...
ar: جاري الإنشاء...
fr: Création...

source: Task created successfully
ar: تم إنشاء المهمة بنجاح
fr: Tâche créée avec succès

source: Tasks Description:
ar: وصف المهام:
fr: Description des tâches:

source: Tasks Locations:
ar: مواقع المهام:
fr: Emplacements des tâches:

source: Contact Phone:
ar: هاتف الاتصال:
fr: Téléphone de contact:

source: Images Preview:
ar: معاينة الصور:
fr: Aperçu des images:

source: No images
ar: لا توجد صور
fr: Aucune image

source: Back to edit
ar: العودة للتعديل
fr: Retour à la modification

# selectLocationOnMap
source: Select a location on the map...
ar: اختر موقعاً على الخريطة...
fr: Sélectionnez un emplacement sur la carte...

source: Getting address...
ar: جاري الحصول على العنوان...
fr: Obtention de l'adresse...

source: Loading map...
ar: جاري تحميل الخريطة...
fr: Chargement de la carte...

source: Confirm Location
ar: تأكيد الموقع
fr: Confirmer l'emplacement

source: Get current location
ar: الحصول على الموقع الحالي
fr: Obtenir l'emplacement actuel

source: Use your current location
ar: استخدم موقعك الحالي
fr: Utiliser votre emplacement actuel

source: Home
ar: الرئيسية
fr: Accueil

source: Orders
ar: الطلبات
fr: Commandes

source: Profile
ar: الملف الشخصي
fr: Profil

source: Settings
ar: الإعدادات
fr: Paramètres

source: Search
ar: بحث
fr: Rechercher

source: Search restaurants...
ar: البحث في المطاعم...
fr: Rechercher des restaurants...

source: Search menu items...
ar: البحث في عناصر القائمة...
fr: Rechercher des articles du menu...

source: Categories
ar: الفئات
fr: Catégories

source: Cuisines
ar: المطابخ

source: Restaurants
ar: المطاعم

source: Menu items
ar: عناصر القائمة
fr: Articles du menu

source: Free delivery
ar: توصيل مجاني
fr: Livraison gratuite

source: Location
ar: الموقع
fr: Emplacement

source: Cuisine
ar: نوع المطبخ

source: Category
ar: الفئة
fr: Catégorie

source: Price
ar: السعر
fr: Prix

source: Select Cuisine Type
ar: اختر نوع المطبخ
fr: Sélectionner le type de cuisine

source: Select Categories
ar: اختر الفئات
fr: Sélectionner les catégories

source: Minimum Order Range
ar: نطاق الحد الأدنى للطلب
fr: Plage de commande minimale

source: Price Range
ar: نطاق السعر
fr: Plage de prix

source: Clear
ar: مسح
fr: Effacer

source: Done
ar: تم
fr: Terminé

source: No cuisines available
ar: لا توجد أنواع مطابخ متاحة
fr: Aucune cuisine disponible

source: No categories available
ar: لا توجد فئات متاحة
fr: Aucune catégorie disponible

source: Loading categories...
ar: جاري تحميل الفئات...
fr: Chargement des catégories...

source: Add New Drinks Menu
ar: إضافة قائمة مشروبات جديدة
fr: Ajouter un nouveau menu de boissons

# addDrinksByCreatingVariants
source: Add drinks by creating variants. Each variant represents a different drink (e.g., Coca Cola, Fanta, Sprite).
ar: أضف المشروبات عن طريق إنشاء خيارات. كل خيار يمثل مشروباً مختلفاً (مثل كوكا كولا، فانتا، سبرايت).
fr: Ajoutez des boissons en créant des variantes. Chaque variante représente une boisson différente (par ex. Coca Cola, Fanta, Sprite).

source: Smart Detection Active
ar: الكشف الذكي نشط
fr: Détection intelligente active

# smartDetectionDescription
source: Each variant will be automatically matched with the correct drink image from our bucket based on its name (e.g., Coca Cola → Coca Cola image).
ar: سيتم مطابقة كل خيار تلقائياً مع صورة المشروب الصحيحة من المجموعة بناءً على اسمه (مثل كوكا كولا → صورة كوكا كولا).
fr: Chaque variante sera automatiquement associée à l'image de boisson correcte de notre bucket selon son nom (par ex. Coca Cola → image Coca Cola).

source: Food Images
ar: صور الطعام
fr: Images de nourriture

source: Review Your Menu Item
ar: مراجعة عنصر القائمة الخاص بك
fr: Examiner votre article du menu

source: Upload Food Images
ar: رفع صور الطعام
fr: Télécharger des images de nourriture

# addHighQualityPhotos
source: Add high-quality photos of your dish (at least 1 required)
ar: أضف صور عالية الجودة لطبقك (مطلوب على الأقل 1 صورة)
fr: Ajoutez des photos de haute qualité de votre plat (au moins 1 requis)

source: Camera
ar: الكاميرا
fr: Caméra

source: Gallery
ar: المعرض
fr: Galerie

# atLeastOneImageRequired
source: At least one image is required
ar: مطلوب صورة واحدة على الأقل
fr: Au moins une image est requise

source: Not selected
ar: غير محدد
fr: Non sélectionné

source: Not entered
ar: غير مدخل
fr: Non saisi

source: None added
ar: لم يتم إضافة أي شيء
fr: Aucun ajouté

source: None uploaded
ar: لم يتم رفع أي شيء
fr: Aucun téléchargé

source: Images
ar: الصور

source: min
ar: دقيقة

source: Max
ar: الحد الأقصى

source: to
ar: إلى
fr: à

source: Preparation Time
ar: وقت التحضير
fr: Temps de préparation

# minutes
source: min
ar: دقيقة

source: Unknown Restaurant
ar: مطعم غير معروف
fr: Restaurant inconnu

# currency
source: DZD
ar: دج

source: No items available
ar: لا توجد عناصر متاحة
fr: Aucun article disponible

source: View All
ar: عرض الكل
fr: Voir tout

source: No menu items available
ar: لا توجد عناصر قائمة متاحة
fr: Aucun article du menu disponible

# debugInfoWillAppearInConsole
source: Debugging info will appear in console logs
ar: ستظهر معلومات التصحيح في سجلات وحدة التحكم
fr: Les informations de débogage apparaîtront dans les journaux de la console

source: Failed to load menu items
ar: فشل في تحميل عناصر القائمة
fr: Échec du chargement des articles du menu

source: Retry
ar: إعادة المحاولة
fr: Réessayer

# noItemsFoundForSearch
source: No items found for "{searchQuery}"
ar: لم يتم العثور على عناصر لـ "{searchQuery}"
fr: Aucun article trouvé pour "{searchQuery}"

# noItemsMatchFilters
source: No items match your filters
ar: لا توجد عناصر تطابق المرشحات الخاصة بك
fr: Aucun article ne correspond à vos filtres

# tryAdjustingSearchTerms
source: Try adjusting your search terms or browse all available items.
ar: حاول تعديل مصطلحات البحث أو تصفح جميع العناصر المتاحة.
fr: Essayez d'ajuster vos termes de recherche ou parcourez tous les articles disponibles.

# tryRemovingFilters
source: Try removing some filters or adjusting your search criteria to find more items.
ar: حاول إزالة بعض المرشحات أو تعديل معايير البحث للعثور على المزيد من العناصر.
fr: Essayez de retirer certains filtres ou d'ajuster vos critères de recherche pour trouver plus d'articles.

# checkBackLaterForNewItems
source: Check back later for new menu items or try refreshing the page.
ar: تحقق مرة أخرى لاحقاً للحصول على عناصر قائمة جديدة أو حاول تحديث الصفحة.
fr: Revenez plus tard pour de nouveaux articles du menu ou essayez d'actualiser la page.

source: Clear Filters
ar: مسح المرشحات
fr: Effacer les filtres

source: Browse All Items
ar: تصفح جميع العناصر
fr: Parcourir tous les articles

source: Best Choices
ar: أفضل الخيارات
fr: Meilleurs choix

source: No offers available
ar: لا توجد عروض متاحة
fr: Aucune offre disponible

source: Check back later for new deals
ar: تحقق مرة أخرى لاحقاً للحصول على صفقات جديدة
fr: Revenez plus tard pour de nouvelles offres

source: Add to Cart
ar: إضافة إلى السلة
fr: Ajouter au panier

source: Confirm Order
ar: تأكيد الطلب
fr: Confirmer la commande

source: Add
ar: أضف
fr: Ajouter

source: item
ar: عنصر
fr: article

source: added to cart
ar: تم إضافته إلى السلة
fr: ajouté au panier

source: Unknown Item
ar: عنصر غير معروف
fr: Article inconnu

source: added to favorites
ar: تم إضافته إلى المفضلة
fr: ajouté aux favoris

source: removed from favorites
ar: تم إزالته من المفضلة
fr: retiré des favoris

source: Failed to update favorite
ar: فشل في تحديث المفضلة
fr: Échec de la mise à jour du favori

source: Special Note
ar: ملاحظة خاصة
fr: Note spéciale

# addSpecialInstructions
source: Add any special instructions...
ar: أضف أي تعليمات خاصة...
fr: Ajoutez des instructions spéciales...

source: Main Item Quantity
ar: كمية العنصر الرئيسي
fr: Quantité de l'article principal

# saveAndAddAnotherOrder
source: Save & Add Another Order
ar: حفظ وإضافة طلب آخر
fr: Enregistrer et ajouter une autre commande

source: Total Price
ar: السعر الإجمالي
fr: Prix total

source: Filter Restaurants
ar: تصفية المطاعم
fr: Filtrer les restaurants

source: Clear All
ar: مسح الكل
fr: Tout effacer

source: Apply Filters
ar: تطبيق المرشحات
fr: Appliquer les filtres

source: Enter city or area
ar: أدخل المدينة أو المنطقة
fr: Entrez la ville ou la zone

source: Map
ar: الخريطة
fr: Carte

source: Minimum Rating
ar: الحد الأدنى للتقييم
fr: Note minimale

source: Delivery Fee Range
ar: نطاق رسوم التوصيل
fr: Plage de frais de livraison

source: Status
ar: الحالة
fr: Statut

source: Open Now
ar: مفتوح الآن
fr: Ouvert maintenant

source: Cuisine Type
ar: نوع المطبخ
fr: Type de cuisine

# pleaseSelectCategoryFirst
source: Select category first
ar: اختر الفئة أولاً
fr: Sélectionnez d'abord une catégorie

source: Restaurant Category
ar: فئة المطعم
fr: Catégorie de restaurant

source: Select category
ar: اختر الفئة
fr: Sélectionner une catégorie

# pleaseSelectCategory
source: Please select a category
ar: يرجى اختيار فئة
fr: Veuillez sélectionner une catégorie

source: Selected Location
ar: الموقع المحدد
fr: Emplacement sélectionné

source: Tap to select location
ar: اضغط لاختيار الموقع
fr: Appuyez pour sélectionner un emplacement

# pleaseSelectLocation
source: Please select a location on the map
ar: يرجى اختيار موقع على الخريطة
fr: Veuillez sélectionner un emplacement sur la carte

source: Location permission denied
ar: تم رفض إذن الموقع
fr: Autorisation de localisation refusée

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied. Please enable in settings.
ar: تم رفض أذونات الموقع نهائياً. يرجى التفعيل في الإعدادات.
fr: Les autorisations de localisation sont définitivement refusées. Veuillez les activer dans les paramètres.

# locationServicesDisabled
source: Location services are disabled
ar: خدمات الموقع معطلة
fr: Les services de localisation sont désactivés

source: Failed to get current location
ar: فشل في الحصول على الموقع الحالي
fr: Échec de l'obtention de l'emplacement actuel

source: Delivery
ar: توصيل
fr: Livraison

source: Pickup
ar: استلام
fr: À emporter

source: Dine-in
ar: تناول في المكان
fr: Sur place

source: Rating
ar: التقييم
fr: Note

source: Reviews
ar: المراجعات
fr: Avis

source: Distance
ar: المسافة

source: Remove from Cart
ar: إزالة من السلة
fr: Retirer du panier

source: View Cart
ar: عرض السلة
fr: Voir le panier

source: Login
ar: تسجيل الدخول
fr: Connexion

source: Register
ar: إنشاء حساب
fr: S'inscrire

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور
fr: Mot de passe

source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

source: Forgot Password?
ar: نسيت كلمة المرور؟
fr: Mot de passe oublié?

source: Remember me
ar: تذكرني
fr: Se souvenir de moi

source: Notifications
ar: الإشعارات

source: Notification Settings
ar: إعدادات الإشعارات
fr: Paramètres de notification

source: Enable Notifications
ar: تفعيل الإشعارات
fr: Activer les notifications

source: Disable Notifications
ar: تعطيل الإشعارات
fr: Désactiver les notifications

source: Language
ar: اللغة
fr: Langue

source: English
ar: الإنجليزية
fr: Anglais

source: French
ar: الفرنسية
fr: Français

source: Arabic
ar: العربية
fr: Arabe

source: Theme
ar: المظهر
fr: Thème

source: Light Mode
ar: المظهر الفاتح
fr: Mode clair

source: Dark Mode
ar: المظهر الداكن
fr: Mode sombre

source: System Theme
ar: مظهر النظام
fr: Thème système

source: About
ar: حول التطبيق
fr: À propos

source: Help
ar: المساعدة
fr: Aide

source: Contact Us
ar: تواصل معنا
fr: Nous contacter

source: Terms of Service
ar: شروط الخدمة
fr: Conditions d'utilisation

source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

source: Error
ar: خطأ
fr: Erreur

source: Success
ar: نجح
fr: Succès

source: Warning
ar: تحذير
fr: Avertissement

# info
source: Information
ar: معلومات

source: OK
ar: موافق

source: Cancel
ar: إلغاء
fr: Annuler

source: Yes
ar: نعم
fr: Oui

source: No
ar: لا
fr: Non

source: Confirm
ar: تأكيد
fr: Confirmer

source: Delete
ar: حذف
fr: Supprimer

source: Edit
ar: تعديل
fr: Modifier

source: Save
ar: حفظ
fr: Enregistrer

source: Submit
ar: إرسال
fr: Soumettre

source: Update
ar: تحديث
fr: Mettre à jour

source: Loading...
ar: جاري التحميل...
fr: Chargement...

source: Please wait...
ar: يرجى الانتظار...
fr: Veuillez patienter...

source: No internet connection
ar: لا يوجد اتصال بالإنترنت
fr: Aucune connexion Internet

source: Something went wrong
ar: حدث خطأ ما
fr: Quelque chose s'est mal passé

source: Try again
ar: حاول مرة أخرى
fr: Réessayer

source: Enable location
ar: تفعيل الموقع
fr: Activer la localisation

source: Location permission required
ar: إذن الموقع مطلوب
fr: Autorisation de localisation requise

source: Camera permission denied
ar: تم رفض إذن الكاميرا
fr: Autorisation de caméra refusée

source: Camera permission required
ar: إذن الكاميرا مطلوب
fr: Autorisation de caméra requise

source: Gallery permission required
ar: إذن المعرض مطلوب
fr: Autorisation de galerie requise

source: No results found
ar: لم يتم العثور على نتائج
fr: Aucun résultat trouvé

source: Search results for
ar: نتائج البحث عن
fr: Résultats de recherche pour

source: Favorites
ar: المفضلة
fr: Favoris

source: Add to favorites
ar: إضافة إلى المفضلة
fr: Ajouter aux favoris

source: Remove from favorites
ar: إزالة من المفضلة
fr: Retirer des favoris

source: Cart
ar: السلة
fr: Panier

# cartEmpty
source: Your cart is empty
ar: سلتك فارغة
fr: Votre panier est vide

source: Total:
ar: المجموع:

source: Subtotal
ar: المجموع الفرعي
fr: Sous-total

source: Tax
ar: الضريبة
fr: Taxe

source: Delivery Fee
ar: رسوم التوصيل
fr: Frais de livraison

source: Service Fee
ar: رسوم الخدمة
fr: Frais de service

source: Order
ar: الطلب
fr: Commande

source: Order Placed
ar: تم الطلب
fr: Commande passée

source: Order Confirmed
ar: تم تأكيد الطلب
fr: Commande confirmée

source: Order Preparing
ar: جاري التحضير
fr: Commande en préparation

source: Order Ready
ar: الطلب جاهز
fr: Commande prête

source: Order Picked Up
ar: تم استلام الطلب
fr: Commande récupérée

source: Order Delivered
ar: تم التوصيل
fr: Commande livrée

source: Order Cancelled
ar: تم إلغاء الطلب
fr: Commande annulée

source: Payment
ar: الدفع
fr: Paiement

source: Payment Method
ar: طريقة الدفع
fr: Méthode de paiement

source: Cash on Delivery
ar: الدفع عند التسليم
fr: Paiement à la livraison

source: Card Payment
ar: دفع بالبطاقة
fr: Paiement par carte

source: Wallet Payment
ar: دفع بالمحفظة
fr: Paiement par portefeuille

source: Restaurant
ar: المطعم

source: Restaurant Details
ar: تفاصيل المطعم
fr: Détails du restaurant

source: Restaurant Menu
ar: قائمة المطعم
fr: Menu du restaurant

source: Restaurant Reviews
ar: مراجعات المطعم
fr: Avis sur le restaurant

source: Restaurant Hours
ar: ساعات العمل
fr: Heures du restaurant

source: Restaurant Location
ar: موقع المطعم
fr: Emplacement du restaurant

source: Restaurant Contact
ar: تواصل مع المطعم
fr: Contact du restaurant

source: Delivery Address
ar: عنوان التوصيل
fr: Adresse de livraison

source: Add Address
ar: إضافة عنوان
fr: Ajouter une adresse

source: Edit Address
ar: تعديل العنوان
fr: Modifier l'adresse

source: Select Address
ar: اختر العنوان
fr: Sélectionner une adresse

source: Edit Profile
ar: تعديل الملف الشخصي
fr: Modifier le profil

source: Personal Information
ar: المعلومات الشخصية
fr: Informations personnelles

source: Account Settings
ar: إعدادات الحساب
fr: Paramètres du compte

source: Welcome
ar: مرحباً
fr: Bienvenue

source: Welcome back
ar: مرحباً بعودتك
fr: Bon retour

source: Sign in to continue
ar: سجل دخولك للمتابعة
fr: Connectez-vous pour continuer

source: Create Account
ar: إنشاء حساب
fr: Créer un compte

source: Sign Up
ar: إنشاء حساب
fr: S'inscrire

source: Sign In
ar: تسجيل الدخول
fr: Se connecter

source: Verification
ar: التحقق
fr: Vérification

source: Verify Phone
ar: التحقق من الهاتف
fr: Vérifier le téléphone

source: Verify Email
ar: التحقق من البريد الإلكتروني
fr: Vérifier l'e-mail

source: Verification Code
ar: رمز التحقق
fr: Code de vérification

source: Resend Code
ar: إعادة إرسال الرمز
fr: Renvoyer le code

source: All Your Needs In One App !
ar: كل احتياجاتك في تطبيق واحد !
fr: Tous Vos Besoins Dans Une Application !

source: Enter phone number
ar: أدخل رقم الهاتف
fr: Entrez le numéro de téléphone

source: Change Phone Number
ar: تغيير رقم الهاتف
fr: Changer le numéro de téléphone

# verifyAndContinue
source: Verify & Continue
ar: التحقق والمتابعة
fr: Vérifier et continuer

# continueButton
source: Continue
ar: متابعة
fr: Continuer

source: Continue as Guest
ar: المتابعة كضيف
fr: Continuer en tant qu'invité

# didntReceiveCode
source: Didn't receive the code?
ar: لم تستلم الرمز؟
fr: Vous n'avez pas reçu le code ?

# resendIn
source: Resend in {seconds}s
ar: إعادة الإرسال خلال {seconds}ث
fr: Renvoyer dans {seconds}s

source: Request New Code
ar: طلب رمز جديد
fr: Demander un nouveau code

# codeExpiresIn
source: Code expires in {minutes}m {seconds}s
ar: ينتهي الرمز خلال {minutes}د {seconds}ث
fr: Le code expire dans {minutes}m {seconds}s

# verificationCodeExpired
source: Verification code has expired
ar: انتهت صلاحية رمز التحقق
fr: Le code de vérification a expiré

# verificationCodeExpiredMessage
source: Verification code has expired. Please request a new one.
ar: انتهت صلاحية رمز التحقق. يرجى طلب رمز جديد.
fr: Le code de vérification a expiré. Veuillez en demander un nouveau.

# sixDigitCode
source: Please enter a 6-digit code
ar: يرجى إدخال رمز مكون من 6 أرقام
fr: Veuillez entrer un code à 6 chiffres

# byContinuingYouAgree
source: By continuing you agree to our
ar: بالمتابعة، أنت توافق على
fr: En continuant, vous acceptez notre

# byClickingContinueYouAcknowledge
source: By clicking on the button continue, you acknowledge that you have read and accepted the
ar: بالنقر على زر المتابعة، أنت تقر بأنك قد قرأت ووافقت على
fr: EN CLIQUANT sur le bouton continuer, vous reconnaissez avoir lu et accepté la

# verificationCodeSentTo
source: Verification code sent to +{countryCode}{phoneNumber}
ar: تم إرسال رمز التحقق إلى +{countryCode}{phoneNumber}
fr: Code de vérification envoyé à +{countryCode}{phoneNumber}

# validationRequired
source: Required
ar: مطلوب
fr: Requis

# validationEmailInvalid
source: Invalid email address
ar: عنوان بريد إلكتروني غير صالح
fr: Adresse e-mail invalide

# validationPhoneInvalid
source: Please enter a valid phone number (at least 10 digits)
ar: يرجى إدخال رقم هاتف صالح (10 أرقام على الأقل)
fr: Veuillez entrer un numéro de téléphone valide (au moins 10 chiffres)

# validationPasswordTooShort
source: Password too short
ar: كلمة المرور قصيرة جداً
fr: Mot de passe trop court

# validationPasswordMismatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة
fr: Les mots de passe ne correspondent pas

# logoutConfirmation
source: Are you sure you want to logout?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟
fr: Êtes-vous sûr de vouloir vous déconnecter?

source: Tap to change photo
ar: اضغط لتغيير الصورة
fr: Appuyez pour changer la photo

source: Full Name
ar: الاسم الكامل
fr: Nom complet

# fullNameRequired
source: Full Name *
ar: الاسم الكامل *
fr: Nom complet *

# nameTooShort
source: Name must be at least 2 characters
ar: يجب أن يكون الاسم حرفين على الأقل
fr: Le nom doit contenir au moins 2 caractères

source: Date of Birth
ar: تاريخ الميلاد
fr: Date de naissance

source: Save Changes
ar: حفظ التغييرات
fr: Enregistrer les modifications

# noDraftTasks
source: No draft tasks to review
ar: لا توجد مهام مسودة للمراجعة
fr: Aucune tâche en brouillon à réviser

source: Task Description:
ar: وصف المهمة:
fr: Description de la tâche:

source: Task Locations
ar: مواقع المهمة
fr: Emplacements de la tâche

source: No phone provided
ar: لم يتم توفير هاتف
fr: Aucun téléphone fourni

source: Primary Location
ar: الموقع الأساسي
fr: Emplacement principal

source: Additional Location
ar: موقع إضافي
fr: Emplacement supplémentaire

source: Unknown address
ar: عنوان غير معروف
fr: Adresse inconnue

source: Task Process
ar: عملية المهمة
fr: Processus de la tâche

source: Task Details
ar: تفاصيل المهمة
fr: Détails de la tâche

# taskLocationsCount
source: Task Locations
ar: مواقع المهمة
fr: Emplacements de la tâche

# tapToViewMap
source: Tap to view map with all locations
ar: انقر لعرض الخريطة مع جميع المواقع
fr: Appuyez pour voir la carte avec tous les emplacements

# unknownPurpose
source: Location purpose
ar: غرض الموقع
fr: Objectif de l'emplacement

source: Deliver to
ar: توصيل إلى
fr: Livrer à

# tapToEnableLocation
source: Tap to enable location access
ar: اضغط لتمكين الوصول للموقع
fr: Appuyez pour activer l'accès à la localisation

# gpsDisabled
source: GPS disabled - tap to enable
ar: GPS معطل - اضغط لتمكينه
fr: GPS désactivé - appuyez pour activer

source: Detecting location...
ar: جاري اكتشاف الموقع...
fr: Détection de l'emplacement...

source: Location Options
ar: خيارات الموقع
fr: Options de localisation

source: Select on Map
ar: اختر على الخريطة
fr: Sélectionner sur la carte

# chooseLocationInteractive
source: Choose location using interactive map
ar: اختر الموقع باستخدام الخريطة التفاعلية
fr: Choisir l'emplacement à l'aide de la carte interactive

source: Refresh Location
ar: تحديث الموقع
fr: Actualiser l'emplacement

# getCurrentLocationBetter
source: Get current location with better accuracy
ar: الحصول على الموقع الحالي بدقة أفضل
fr: Obtenir l'emplacement actuel avec une meilleure précision

# noMin
source: No minimum
ar: لا يوجد حد أدنى
fr: Pas de minimum

source: Estimated delivery time
ar: وقت التوصيل المتوقع
fr: Temps de livraison estimé

source: Filter
ar: تصفية
fr: Filtrer

source: Apply
ar: تطبيق
fr: Appliquer

source: Sort by
ar: ترتيب حسب
fr: Trier par

source: Delivery time
ar: وقت التوصيل
fr: Temps de livraison

source: Alphabetical
ar: أبجدي
fr: Alphabétique

source: Popular
ar: شائع
fr: Populaire

source: Trending
ar: رائج
fr: Tendance

# newItem
source: New
ar: جديد
fr: Nouveau

source: Featured
ar: مميز
fr: En vedette

source: Menu Item Details
ar: تفاصيل عنصر القائمة
fr: Détails de l'article du menu

source: Ingredients
ar: المكونات
fr: Ingrédients

source: Allergens
ar: مسببات الحساسية
fr: Allergènes

# nutritionalInfo
source: Nutritional Information
ar: المعلومات الغذائية
fr: Informations nutritionnelles

source: Customize
ar: تخصيص
fr: Personnaliser

source: Share
ar: مشاركة
fr: Partager

source: Active Orders
ar: الطلبات النشطة
fr: Commandes actives

source: Order Summary
ar: ملخص الطلب
fr: Résumé de la commande

source: Order Details
ar: تفاصيل الطلب
fr: Détails de la commande

source: Track Order
ar: تتبع الطلب
fr: Suivre la commande

source: Order Status
ar: حالة الطلب
fr: Statut de la commande
