Repository: godigitaldz/sahla-backend
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Estimated Arrival
ar: الوصول المتوقع
fr: Arrivée estimée

source: Delivered
ar: تم التسليم
fr: Livré

source: Preparing
ar: جاري التحضير
fr: En préparation

source: Ready
ar: جاهز
fr: Prêt

source: Picked Up
ar: تم الاستلام
fr: Récupéré

source: Cancelled
ar: ملغي
fr: Annulé

source: Promo Code
ar: رمز الخصم
fr: Code promo

# applyPromo
source: Apply Promo Code
ar: تطبيق رمز الخصم
fr: Appliquer le code promo

source: Add New Address
ar: إضافة عنوان جديد
fr: Ajouter une nouvelle adresse

source: Change Address
ar: تغيير العنوان
fr: Changer l'adresse

source: Order Updates
ar: تحديثات الطلبات
fr: Mises à jour de commande

source: Promotional Offers
ar: العروض الترويجية
fr: Offres promotionnelles

source: New Restaurants
ar: مطاعم جديدة
fr: Nouveaux restaurants

source: Delivery Updates
ar: تحديثات التوصيل
fr: Mises à jour de livraison

source: Check back later
ar: تحقق لاحقاً
fr: Revenez plus tard

source: Loading cuisines...
ar: جاري تحميل المطابخ...
fr: Chargement des cuisines...

# pleaseSelectCuisineType
source: Please select a cuisine type
ar: يرجى اختيار نوع مطبخ
fr: Veuillez sélectionner un type de cuisine

source: No minimum
ar: لا يوجد حد أدنى
fr: Pas de minimum

# algerianDinar
source: DA
ar: دج

# restaurantNameLabel
source: Restaurant name: {restaurantName}
ar: اسم المطعم: {restaurantName}
fr: Nom du restaurant: {restaurantName}

# restaurantDetailsLabel
source: Restaurant details: {infoText}
ar: تفاصيل المطعم: {infoText}
fr: Détails du restaurant: {infoText}

# doubleTapToRemove
source: Double tap to remove {restaurantName} from favorites
ar: انقر نقراً مزدوجاً لإزالة {restaurantName} من المفضلة
fr: Double appui pour retirer {restaurantName} des favoris

# doubleTapToAdd
source: Double tap to add {restaurantName} to favorites
ar: انقر نقراً مزدوجاً لإضافة {restaurantName} إلى المفضلة
fr: Double appui pour ajouter {restaurantName} aux favoris

source: Available
ar: متاح
fr: Disponible

source: Not Available
ar: غير متاح
fr: Non disponible

# priceLabel
source: Price
ar: السعر
fr: Prix

# ratingLabel
source: Rating
ar: التقييم
fr: Note

# reviewsLabel
source: Reviews
ar: المراجعات
fr: Avis

# distanceLabel
source: Distance
ar: المسافة

# deliveryTimeLabel
source: Delivery Time
ar: وقت التوصيل
fr: Temps de livraison

# cuisineLabel
source: Cuisine
ar: نوع المطبخ

# categoryLabel
source: Category
ar: الفئة
fr: Catégorie

# featuredLabel
source: Featured
ar: مميز
fr: En vedette

# popularLabel
source: Popular
ar: شائع
fr: Populaire

# trendingLabel
source: Trending
ar: رائج
fr: Tendance

# newLabel
source: New
ar: جديد
fr: Nouveau

# bestChoicesLabel
source: Best Choices
ar: أفضل الخيارات
fr: Meilleurs choix

# viewAllLabel
source: View All
ar: عرض الكل
fr: Voir tout

# restaurantsLabel
source: Restaurants
ar: المطاعم

# menuItemsLabel
source: Menu Items
ar: عناصر القائمة
fr: Articles du menu

# searchRestaurantsLabel
source: Search restaurants
ar: البحث في المطاعم
fr: Rechercher restaurants

# filterLabel
source: Filter
ar: تصفية
fr: Filtrer

# applyLabel
source: Apply
ar: تطبيق
fr: Appliquer

# clearAllLabel
source: Clear All
ar: مسح الكل
fr: Tout effacer

# priceRangeLabel
source: Price Range
ar: نطاق السعر
fr: Plage de prix

# sortByLabel
source: Sort by
ar: ترتيب حسب
fr: Trier par

# distanceSort
source: Distance
ar: المسافة

# ratingSort
source: Rating
ar: التقييم
fr: Note

# deliveryTimeSort
source: Delivery time
ar: وقت التوصيل
fr: Temps de livraison

# alphabeticalSort
source: Alphabetical
ar: أبجدي
fr: Alphabétique

source: No restaurants found
ar: لم يتم العثور على مطاعم
fr: Aucun restaurant trouvé

# tryAdjustingSearch
source: Try adjusting your search criteria
ar: حاول تعديل معايير البحث
fr: Essayez d'ajuster vos critères de recherche

source: Loading restaurants...
ar: جاري تحميل المطاعم...
fr: Chargement des restaurants...

source: Error loading restaurants
ar: خطأ في تحميل المطاعم
fr: Erreur lors du chargement des restaurants

# retryLabel
source: Retry
ar: إعادة المحاولة
fr: Réessayer

# restaurantsCount
source: {count} restaurants
ar: {count} مطعم

# minimumOrderLabel
source: Min Order
ar: الحد الأدنى
fr: Commande min

# deliveryFeeLabel
source: Delivery Fee
ar: رسوم التوصيل
fr: Frais de livraison

# cityLabel
source: City
ar: المدينة
fr: Ville

# workingHoursLabel
source: Working Hours
ar: ساعات العمل
fr: Heures d'ouverture

# openLabel
source: Open
ar: مفتوح
fr: Ouvert

# closedLabel
source: Closed
ar: مغلق
fr: Fermé

# minLabel
source: min
ar: دقيقة

# noMinLabel
source: No Min
ar: لا يوجد حد أدنى
fr: Pas de minimum

# freeDeliveryLabel
source: Free delivery
ar: توصيل مجاني
fr: Livraison gratuite

# restaurantLogoLabel
source: {restaurantName} restaurant logo
ar: شعار مطعم {restaurantName}
fr: Logo du restaurant {restaurantName}

# viewAllButton
source: View All
ar: عرض الكل
fr: Voir tout

# liveUpdatesTitle
source: Live Updates
ar: التحديثات المباشرة
fr: Mises à jour en direct

source: Just now
ar: الآن
fr: À l'instant

# minutesAgo
source: {minutes}m ago
ar: منذ {minutes} دقيقة
fr: {min}m

# hoursAgo
source: {count} {plural} ago
ar: منذ {count} {plural}
fr: il y a {count} {plural}

# daysAgo
source: {count} {plural} ago
ar: منذ {count} {plural}
fr: il y a {count} {plural}

# todayLabel
source: Today
ar: اليوم
fr: Aujourd'hui

# tomorrowLabel
source: Tomorrow
ar: غداً
fr: Demain

# openingHoursLabel
source: Opening Hours
ar: ساعات الفتح
fr: Heures d'ouverture

# closingHoursLabel
source: Closing Hours
ar: ساعات الإغلاق
fr: Heures de fermeture

# menuItemNameLabel
source: Menu item: {itemName}
ar: عنصر القائمة: {itemName}
fr: Article du menu : {itemName}

source: Menu Item Name
ar: اسم عنصر القائمة
fr: Nom de l'article du menu

source: Enter the name of your menu item
ar: أدخل اسم عنصر القائمة الخاص بك
fr: Entrez le nom de votre article du menu

# menuItemPriceLabel
source: Price: {price} DA
ar: السعر: {price} دج
fr: Prix: {price} DA

# menuItemDescriptionLabel
source: Description: {description}
ar: الوصف: {description}

# ingredientsLabel
source: Ingredients
ar: المكونات
fr: Ingrédients

# allergensLabel
source: Allergens
ar: مسببات الحساسية
fr: Allergènes

# nutritionalInfoLabel
source: Nutritional Information
ar: المعلومات الغذائية
fr: Informations nutritionnelles

# customizeLabel
source: Customize
ar: تخصيص
fr: Personnaliser

# shareLabel
source: Share
ar: مشاركة
fr: Partager

# activeOrdersLabel
source: Active Orders
ar: الطلبات النشطة
fr: Commandes actives

# orderSummaryLabel
source: Order Summary
ar: ملخص الطلب
fr: Résumé de la commande

# orderDetailsLabel
source: Order Details
ar: تفاصيل الطلب
fr: Détails de la commande

# trackOrderLabel
source: Track Order
ar: تتبع الطلب
fr: Suivre la commande

# orderStatusLabel
source: Order Status
ar: حالة الطلب
fr: Statut de la commande

# estimatedArrivalLabel
source: Estimated Arrival
ar: الوصول المتوقع
fr: Arrivée estimée

# deliveredLabel
source: Delivered
ar: تم التوصيل
fr: Livré

# preparingLabel
source: Preparing
ar: قيد التحضير
fr: En préparation

# readyLabel
source: Ready
ar: جاهز
fr: Prêt

# pickedUpLabel
source: Picked Up
ar: تم الاستلام
fr: Récupéré

# cancelledLabel
source: Cancelled
ar: ملغي
fr: Annulé

# paymentMethodLabel
source: Payment Method
ar: طريقة الدفع
fr: Méthode de paiement

# cashOnDeliveryLabel
source: Cash on Delivery
ar: الدفع عند التسليم
fr: Paiement à la livraison

# cardPaymentLabel
source: Card Payment
ar: دفع بالبطاقة
fr: Paiement par carte

# walletPaymentLabel
source: Wallet Payment
ar: دفع بالمحفظة
fr: Paiement par portefeuille

# promoCodeLabel
source: Promo Code
ar: رمز الخصم
fr: Code promo

# applyPromoLabel
source: Apply Promo Code
ar: تطبيق رمز الخصم
fr: Appliquer le code promo

# deliveryAddressLabel
source: Delivery Address
ar: عنوان التوصيل
fr: Adresse de livraison

# addNewAddressLabel
source: Add New Address
ar: إضافة عنوان جديد
fr: Ajouter une nouvelle adresse

# selectAddressLabel
source: Select Address
ar: اختر العنوان
fr: Sélectionner une adresse

# changeAddressLabel
source: Change Address
ar: تغيير العنوان
fr: Changer l'adresse

# notificationsLabel
source: Notifications
ar: الإشعارات

# notificationSettingsLabel
source: Notification Settings
ar: إعدادات الإشعارات
fr: Paramètres de notification

# orderUpdatesLabel
source: Order Updates
ar: تحديثات الطلبات
fr: Mises à jour de commande

# promotionalOffersLabel
source: Promotional Offers
ar: العروض الترويجية
fr: Offres promotionnelles

# newRestaurantsLabel
source: New Restaurants
ar: مطاعم جديدة
fr: Nouveaux restaurants

# deliveryUpdatesLabel
source: Delivery Updates
ar: تحديثات التوصيل
fr: Mises à jour de livraison

# nameMinLength
source: Name must be at least 2 characters
ar: يجب أن يكون الاسم حرفين على الأقل
fr: Le nom doit contenir au moins 2 caractères

# invalidImageError
source: Invalid image. Please select a valid image under 5MB.
ar: صورة غير صالحة. يرجى اختيار صورة صالحة أقل من 5 ميجابايت.
fr: Image invalide. Veuillez sélectionner une image valide de moins de 5 Mo.

# profileImageUpdated
source: Profile image updated successfully!
ar: تم تحديث صورة الملف الشخصي بنجاح!
fr: Image de profil mise à jour avec succès !

# imageUploadFailed
source: Failed to upload image: {error}
ar: فشل في رفع الصورة: {error}
fr: Échec du téléchargement de l'image : {error}

# errorOccurred
source: Error: {error}
ar: خطأ: {error}
fr: Erreur: {error}

# profileUpdated
source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!
fr: Profil mis à jour avec succès !

# profileUpdateError
source: Error updating profile: {error}
ar: خطأ في تحديث الملف الشخصي: {error}
fr: Erreur lors de la mise à jour du profil : {error}

source: Become Delivery Man
ar: كن عامل توصيل
fr: Devenir livreur

source: Become Sahla Partner
ar: كن شريك سحلى
fr: Devenir partenaire Sahla

# growWithSahla
source: Grow with Sahla services
ar: انمو مع خدمات سحلى
fr: Développez avec les services Sahla

source: Tap to detect location
ar: اضغط لاكتشاف الموقع
fr: Appuyez pour détecter l'emplacement

source: Delivery unavailable
ar: التوصيل غير متاح
fr: Livraison indisponible

source: Pick Location
ar: اختر الموقع
fr: Choisir l'emplacement

source: Edit Location
ar: تعديل الموقع
fr: Modifier l'emplacement

source: Proceed or Discard?
ar: المتابعة أو الإلغاء؟
fr: Continuer ou Annuler?

# proceedOrDiscardMessage
source: You have activated location services. Do you want to proceed with the selected location or discard the changes?
ar: لقد قمت بتفعيل خدمات الموقع. هل تريد المتابعة مع الموقع المحدد أم إلغاء التغييرات؟
fr: Vous avez activé les services de localisation. Voulez-vous continuer avec l'emplacement sélectionné ou annuler les modifications?

# locationEditedMessage
source: You have edited the location. Do you want to proceed with the selected location or discard the changes?
ar: لقد قمت بتعديل الموقع. هل تريد المتابعة مع الموقع المحدد أم إلغاء التغييرات؟
fr: Vous avez modifié l'emplacement. Voulez-vous continuer avec l'emplacement sélectionné ou annuler les modifications?

source: Proceed
ar: متابعة
fr: Continuer

source: Discard
ar: إلغاء
fr: Annuler

source: Approximate Price
ar: السعر التقريبي
fr: Prix approximatif

source: Add secondary phone?
ar: إضافة رقم هاتف ثانوي؟
fr: Ajouter un numéro de téléphone secondaire?

# chooseLocationOnMap
source: Choose location using interactive map
ar: اختر الموقع باستخدام الخريطة التفاعلية
fr: Choisir l'emplacement à l'aide de la carte interactive

source: Create Ifrili Task
ar: إنشاء مهمة إفرلي
fr: Créer une tâche Ifrili

source: Required
ar: مطلوب
fr: Requis

# dropPinOnMapFirst
source: Drop a pin on the map first
ar: ضع علامة على الخريطة أولاً
fr: Placez d'abord une épingle sur la carte

# pleaseDropPinOrAddLocations
source: Please drop a pin on the map or add locations
ar: يرجى وضع علامة على الخريطة أو إضافة مواقع
fr: Veuillez placer une épingle sur la carte ou ajouter des emplacements

# errorUploadingImage
source: Error uploading image: {error}
ar: خطأ في رفع الصورة: {error}
fr: Erreur lors du téléchargement de l'image : {error}

source: Review Ifrili Tasks
ar: مراجعة مهام إفرلي
fr: Réviser les tâches Ifrili

source: No draft tasks to review
ar: لا توجد مهام مسودة للمراجعة
fr: Aucune tâche en brouillon à réviser

source: Confirm & Create Tasks
ar: تأكيد وإنشاء المهام
fr: Confirmer et créer les tâches

# failedToCreateTasks
source: Failed to create tasks: {error}
ar: فشل في إنشاء المهام: {error}
fr: Échec de la création des tâches : {error}

# tapToViewMapWithLocations
source: Tap to view map with all locations
ar: اضغط لعرض الخريطة مع جميع المواقع
fr: Appuyez pour voir la carte avec tous les emplacements

# locationCount
source: {count} location{plural}
ar: {count} موقع

source: Pending
ar: في الانتظار
fr: En attente

source: Cost Review
ar: مراجعة التكلفة
fr: Révision du coût

source: Cost Agreed
ar: تم الاتفاق على التكلفة
fr: Coût convenu

source: Assigned
ar: مُعيّن
fr: Assigné

source: Completed
ar: مكتمل
fr: Terminé

# taskLocationsSection
source: Task Locations:
ar: مواقع المهمة:
fr: Emplacements de la tâche:

# failedToOpenMapView
source: Failed to open map view: {error}
ar: فشل في فتح عرض الخريطة: {error}
fr: Échec de l'ouverture de la vue de la carte : {error}

source: Delivery Man Application
ar: طلب سائق التوصيل
fr: Candidature de livreur

source: Join Our Delivery Team!
ar: انضم إلى فريق التوصيل لدينا!
fr: Rejoignez notre équipe de livraison !

# earnMoneyHelpingPeople
source: Earn money while helping people get their food
ar: اكسب المال أثناء مساعدة الناس في الحصول على طعامهم
fr: Gagnez de l'argent tout en aidant les gens à obtenir leur nourriture

source: Enter your full name
ar: أدخل اسمك الكامل
fr: Entrez votre nom complet

source: Please enter your full name
ar: يرجى إدخال اسمك الكامل
fr: Veuillez entrer votre nom complet

# phoneNumberRequired
source: Phone Number *
ar: رقم الهاتف *
fr: Numéro de téléphone *

source: Enter your phone number
ar: أدخل رقم هاتفك
fr: Entrez votre numéro de téléphone

source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك
fr: Veuillez entrer votre numéro de téléphone

# addressRequired
source: Address *
ar: العنوان *
fr: Adresse *

source: Enter your current address
ar: أدخل عنوانك الحالي
fr: Entrez votre adresse actuelle

source: Please enter your address
ar: يرجى إدخال عنوانك
fr: Veuillez entrer votre adresse

source: Vehicle Information
ar: معلومات المركبة
fr: Informations sur le véhicule

# vehicleTypeRequired
source: Vehicle Type *
ar: نوع المركبة *
fr: Type de véhicule *

# vehicleModelRequired
source: Vehicle Model *
ar: طراز المركبة *
fr: Modèle de véhicule *

source: Enter your vehicle model
ar: أدخل طراز مركبتك
fr: Entrez le modèle de votre véhicule

source: Please enter your vehicle model
ar: يرجى إدخال طراز مركبتك
fr: Veuillez entrer le modèle de votre véhicule

# vehicleYearRequired
source: Vehicle Year *
ar: سنة المركبة *
fr: Année du véhicule *

source: Enter your vehicle year
ar: أدخل سنة مركبتك
fr: Entrez l'année de votre véhicule

source: Please enter your vehicle year
ar: يرجى إدخال سنة مركبتك
fr: Veuillez entrer l'année de votre véhicule

# vehicleColorRequired
source: Vehicle Color *
ar: لون المركبة *
fr: Couleur du véhicule *

source: Enter your vehicle color
ar: أدخل لون مركبتك
fr: Entrez la couleur de votre véhicule

source: Please enter your vehicle color
ar: يرجى إدخال لون مركبتك
fr: Veuillez entrer la couleur de votre véhicule

# licenseNumberRequired
source: License Number *
ar: رقم الرخصة *
fr: Numéro de permis *

source: Enter your driving license number
ar: أدخل رقم رخصة القيادة الخاصة بك
fr: Entrez votre numéro de permis de conduire

source: Please enter your license number
ar: يرجى إدخال رقم رخصتك
fr: Veuillez entrer votre numéro de permis

source: Availability
ar: التوفر
fr: Disponibilité

# availabilityRequired
source: Availability *
ar: التوفر *
fr: Disponibilité *

source: Previous Experience (Optional)
ar: الخبرة السابقة (اختياري)
fr: Expérience antérieure (optionnel)

# describePreviousExperience
source: Describe any previous delivery or customer service experience
ar: صف أي خبرة سابقة في التوصيل أو خدمة العملاء
fr: Décrivez toute expérience antérieure en livraison ou service client

source: Requirements
ar: المتطلبات
fr: Exigences

# haveValidDrivingLicense
source: I have a valid driving license
ar: لدي رخصة قيادة صالحة
fr: J'ai un permis de conduire valide

# haveReliableVehicle
source: I have a reliable vehicle
ar: لدي مركبة موثوقة
fr: J'ai un véhicule fiable

source: Available on weekends
ar: متاح في عطلات نهاية الأسبوع
fr: Disponible le week-end

source: Available in evenings
ar: متاح في المساء
fr: Disponible en soirée

source: Benefits of Joining
ar: فوائد الانضمام
fr: Avantages de rejoindre

source: Flexible earning opportunities
ar: فرص كسب مرنة
fr: Opportunités de gains flexibles

source: Work on your own schedule
ar: اعمل حسب جدولك الزمني الخاص
fr: Travaillez selon votre propre horaire

source: Deliver in your local area
ar: قم بالتوصيل في منطقتك المحلية
fr: Livrez dans votre région

# supportTeam
source: 24/7 support team
ar: فريق دعم على مدار 24/7
fr: Équipe de support 24/7

source: Performance bonuses
ar: مكافآت الأداء
fr: Bonus de performance

source: Submit Application
ar: إرسال الطلب
fr: Soumettre la candidature

source: Reset Form
ar: إعادة تعيين النموذج
fr: Réinitialiser le formulaire

source: Submitting application...
ar: جاري إرسال الطلب...
fr: Soumission de la candidature...

# applicationSubmittedSuccessfully
source: Application submitted successfully! We'll review it within 24-48 hours.
ar: تم إرسال الطلب بنجاح! سنقوم بمراجعته خلال 24-48 ساعة.
fr: Candidature soumise avec succès ! Nous l'examinerons dans les 24 à 48 heures.

# submitApplicationConfirmation
source: Submit Application?
ar: إرسال الطلب؟
fr: Soumettre la candidature ?

# confirmApplicationSubmission
source: Are you sure you want to submit your delivery application? Make sure all information is correct.
ar: هل أنت متأكد من أنك تريد إرسال طلب التوصيل الخاص بك؟ تأكد من أن جميع المعلومات صحيحة.
fr: Êtes-vous sûr de vouloir soumettre votre candidature de livraison ? Assurez-vous que toutes les informations sont correctes.

# termsAndConditions
source: By submitting this application, you agree to our terms and conditions and privacy policy.
ar: بإرسال هذا الطلب، فإنك توافق على شروطنا وأحكامنا وسياسة الخصوصية.
fr: En soumettant cette candidature, vous acceptez nos conditions générales et notre politique de confidentialité.

# validationNameRequired
source: Please enter your full name
ar: يرجى إدخال اسمك الكامل
fr: Veuillez entrer votre nom complet

# validationPhoneRequired
source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك
fr: Veuillez entrer votre numéro de téléphone

# validationPhoneFormat
source: Please enter a valid phone number format
ar: يرجى إدخال تنسيق رقم هاتف صالح
fr: Veuillez entrer un format de numéro de téléphone valide

# validationAddressRequired
source: Please enter your address
ar: يرجى إدخال عنوانك
fr: Veuillez entrer votre adresse

# validationVehicleTypeRequired
source: Please select a vehicle type
ar: يرجى اختيار نوع المركبة
fr: Veuillez sélectionner un type de véhicule

# validationVehicleModelRequired
source: Please enter your vehicle model
ar: يرجى إدخال طراز المركبة
fr: Veuillez entrer le modèle de votre véhicule

# validationVehicleYearRequired
source: Please enter your vehicle year
ar: يرجى إدخال سنة المركبة
fr: Veuillez entrer l'année de votre véhicule

# validationVehicleColorRequired
source: Please enter your vehicle color
ar: يرجى إدخال لون المركبة
fr: Veuillez entrer la couleur de votre véhicule

# validationLicenseNumberRequired
source: Please enter your license number
ar: يرجى إدخال رقم الرخصة
fr: Veuillez entrer votre numéro de permis

# validationAvailabilityRequired
source: Please select your availability
ar: يرجى اختيار التوفر
fr: Veuillez sélectionner votre disponibilité

# validationLicenseRequired
source: You must have a valid driving license
ar: يجب أن يكون لديك رخصة قيادة صالحة
fr: Vous devez avoir un permis de conduire valide

# validationVehicleRequired
source: You must have a reliable vehicle
ar: يجب أن يكون لديك مركبة موثوقة
fr: Vous devez avoir un véhicule fiable

# errorSubmittingApplication
source: Error submitting application: {error}
ar: خطأ في إرسال الطلب: {error}
fr: Erreur lors de la soumission de la candidature : {error}

# errorUnexpected
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.
fr: Une erreur inattendue s'est produite. Veuillez réessayer.

# errorNetwork
source: Please check your internet connection
ar: يرجى التحقق من اتصال الإنترنت الخاص بك
fr: Veuillez vérifier votre connexion Internet

# errorServer
source: Service temporarily unavailable. Please try again later
ar: الخدمة غير متاحة مؤقتاً. يرجى المحاولة مرة أخرى لاحقاً
fr: Service temporairement indisponible. Veuillez réessayer plus tard

# errorDuplicateApplication
source: You have already submitted an application
ar: لقد قدمت طلباً بالفعل
fr: Vous avez déjà soumis une candidature

# errorInvalidYear
source: Please enter a valid year (1990-2030)
ar: يرجى إدخال سنة صالحة (1990-2030)
fr: Veuillez entrer une année valide (1990-2030)

# errorMissingLicense
source: You must have a valid driving license
ar: يجب أن يكون لديك رخصة قيادة صالحة
fr: Vous devez avoir un permis de conduire valide

# errorMissingVehicle
source: You must have a reliable vehicle
ar: يجب أن يكون لديك مركبة موثوقة
fr: Vous devez avoir un véhicule fiable

# applicationDraftSaved
source: Draft saved
ar: تم حفظ المسودة
fr: Brouillon enregistré

# applicationDraftRestored
source: Draft restored
ar: تم استعادة المسودة
fr: Brouillon restauré

source: already exists
ar: يوجد بالفعل
fr: existe déjà

source: Available for Variants
ar: متاح للأصناف
fr: Disponible pour les variantes

source: Optional
ar: اختياري
fr: Optionnel

# selectVariantsForSupplement
source: Select which variants this supplement is available for. Leave empty for all variants.
ar: اختر الأصناف التي سيكون هذا المكمل متاحاً لها. اتركه فارغاً لجميع الأصناف.
fr: Sélectionnez les variantes pour lesquelles ce supplément est disponible. Laissez vide pour toutes les variantes.

source: Your Order
ar: طلبك
fr: Your Commande

source: items
ar: عناصر
fr: articles

source: Enter promo code
ar: أدخل رمز الخصم
fr: Entrez le code promo

# promoCodeApplied
source: Promo code applied successfully!
ar: تم تطبيق رمز الخصم بنجاح!
fr: Code promo appliqué avec succès !

source: Promo code removed
ar: تم إزالة رمز الخصم
fr: Code promo supprimé

# promoCodeNotApplicable
source: Promo code is not applicable to your current cart
ar: رمز الخصم غير قابل للتطبيق على سلتك الحالية
fr: Le code promo n'est pas applicable à votre panier actuel

source: Invalid promo code
ar: رمز خصم غير صالح
fr: Code promo invalide

# errorApplyingPromoCode
source: Error applying promo code. Please try again.
ar: خطأ في تطبيق رمز الخصم. يرجى المحاولة مرة أخرى.
fr: Erreur lors de l'application du code promo. Veuillez réessayer.

source: Error removing promo code
ar: خطأ في إزالة رمز الخصم
fr: Erreur lors de la suppression du code promo

source: Clear Cart
ar: مسح السلة
fr: Vider le panier

# clearCartConfirmation
source: Are you sure you want to remove all items from your cart?
ar: هل أنت متأكد من أنك تريد إزالة جميع العناصر من سلتك؟
fr: Êtes-vous sûr de vouloir retirer tous les articles de votre panier ?

source: Discount
ar: خصم
fr: Remise

source: Size
ar: الحجم
fr: Taille

source: Regular
ar: عادي
fr: Régulier

# noItemsInOrder
source: No items in this order
ar: لا توجد عناصر في هذا الطلب
fr: Aucun article dans cette commande

# orderNumber
source: Order #
ar: طلب رقم
fr: Commande n°

source: Variant
ar: النوع
fr: Variante

source: Supplements
ar: الإضافات
fr: Suppléments

source: Drinks
ar: المشروبات
fr: boissons

source: Drinks by Restaurant
ar: مشروبات المطعم
fr: Boissons par restaurant

source: Variants
ar: الخيارات
fr: Variantes

# forVariant
source: for
ar: لـ
fr: pour
