Repository: godigitaldz/sahla-backend
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# customizeIngredients
source: Ingredients
ar: المكونات
fr: Ingrédients

# customizeOrder
source: Customize Your Order
ar: خصص طلبك
fr: Personnalisez votre commande

source: Tap to edit
ar: انقر للتعديل
fr: Appuyez pour modifier

source: Tap to expand
ar: انقر للتوسيع
fr: Appuyez pour développer

source: Add Supplements
ar: الإضافات
fr: Ajouter des suppléments

source: Main Pack Ingredients
ar: مكونات الحزمة الرئيسية
fr: Ingrédients principaux du pack

source: Free Drinks Included
ar: المشروبات المجانية المضمنة
fr: Boissons gratuites incluses

# chooseUpToComplimentaryDrink
source: Choose up to {count} complimentary {drink}{plural}
ar: اختر حتى {count} {drink} مجاني{plural}
fr: Choisissez jusqu'à {count} {drink} gratuit{plural}

source: Saved Orders
ar: الطلبات المحفوظة
fr: Commandes enregistrées

# choosePreferencesForEachItem
source: Choose your preferences for each item
ar: اختر تفضيلاتك لكل عنصر
fr: Choisissez vos préférences pour chaque article

# chooseVariant
source: Pick your choice
ar: اختر مايناسب ذوقك
fr: Choisissez votre favori

source: Ingredient Preferences
ar: تفضيلات المكونات
fr: Préférences d'ingrédients

source: Normal
ar: عادي

source: More
ar: المزيد
fr: Plus

source: Less
ar: أقل
fr: Moins

source: Want more
ar: أريد المزيد
fr: Vous en voulez plus

# defaultOption
source: Default
ar: افتراضي
fr: Option par défaut

source: Special Instructions:
ar: تعليمات خاصة:
fr: Instructions spéciales :

source: Remove Item
ar: إزالة العنصر
fr: Retirer l'article

# removeItemConfirmation
source: Are you sure you want to remove
ar: هل أنت متأكد من أنك تريد إزالة
fr: Êtes-vous sûr de vouloir retirer

source: from your order?
ar: من طلبك؟
fr: de votre commande ?

source: Invalid cart item data
ar: بيانات عنصر السلة غير صالحة
fr: Données d'article de panier invalides

source: Delivery Details
ar: تفاصيل التوصيل
fr: Détails de livraison

source: Use Current Location
ar: استخدام الموقع الحالي
fr: Utiliser l'emplacement actuel

source: Choose on Map
ar: اختر على الخريطة
fr: Choisir sur la carte

source: Loading address...
ar: جاري تحميل العنوان...
fr: Chargement de l'adresse...

source: No address selected
ar: لم يتم اختيار عنوان
fr: Aucune adresse sélectionnée

source: Secondary phone (optional)
ar: رقم هاتف ثانوي (اختياري)
fr: Téléphone secondaire (optionnel)

# preparingOrder
source: Preparing your order at the restaurant...
ar: جاري تحضير طلبك في المطعم...
fr: Préparation de votre commande au restaurant...

# preparingOrderSubtext
source: You can close this and track live at any time.
ar: يمكنك إغلاق هذا وتتبع الطلب مباشرة في أي وقت.
fr: Vous pouvez fermer ceci et suivre en direct à tout moment.

source: Ready for pickup
ar: جاهز للاستلام
fr: Prêt pour la récupération

# deliveryPartnerPickup
source: A delivery partner will pick up your order soon.
ar: سيقوم شريك التوصيل بجلب طلبك قريباً.
fr: Un partenaire de livraison récupérera votre commande bientôt.

# pleaseSelectDeliveryLocation
source: Please select a delivery location option first
ar: يرجى اختيار خيار موقع التوصيل أولاً
fr: Veuillez d'abord sélectionner une option d'emplacement de livraison

# pleaseSelectDeliveryLocationOption
source: Please select a delivery location
ar: يرجى اختيار موقع التوصيل
fr: Veuillez sélectionner un emplacement de livraison

source: Failed to confirm order
ar: فشل في تأكيد الطلب
fr: Échec de la confirmation de la commande

source: Switch map type
ar: تبديل نوع الخريطة
fr: Changer le type de carte

source: Selected on map
ar: تم اختياره على الخريطة
fr: Sélectionné sur la carte

source: Your cart is empty
ar: سلتك فارغة
fr: Votre panier est vide

# addDeliciousItems
source: Add some delicious items to get started!
ar: أضف بعض الأطباق اللذيذة للبدء!
fr: Ajoutez de délicieux articles pour commencer !

source: Browse Menu
ar: تصفح القائمة
fr: Parcourir le menu

# tapFloatingCartIcon
source: Tap the floating cart icon when you add items
ar: اضغط على أيقونة السلة العائمة عند إضافة العناصر
fr: Appuyez sur l'icône de panier flottante lorsque vous ajoutez des articles

# cannotPlaceCall
source: Cannot place a call on this device
ar: لا يمكن إجراء مكالمة على هذا الجهاز
fr: Impossible de passer un appel sur cet appareil

source: Failed to open dialer
ar: فشل في فتح طالب الهاتف
fr: Échec de l'ouverture du composeur

source: Map Loading Error
ar: خطأ في تحميل الخريطة
fr: Erreur de chargement de la carte

source: Delivery Partner
ar: شريك التوصيل
fr: Partenaire de livraison

source: On the way
ar: في الطريق
fr: En chemin

source: Phone number not available
ar: رقم الهاتف غير متوفر
fr: Numéro de téléphone non disponible

source: Update Location
ar: تحديث الموقع
fr: Mettre à jour l'emplacement

source: Placed
ar: تم الطلب
fr: Passée

source: Confirm Reception
ar: تأكيد الاستلام
fr: Confirmer la réception

source: Reception confirmed
ar: تم تأكيد الاستلام
fr: Réception confirmée

source: Failed to confirm reception
ar: فشل في تأكيد الاستلام
fr: Échec de la confirmation de réception

source: Failed to confirm
ar: فشل في التأكيد
fr: Échec de la confirmation

source: Unit Price:
ar: سعر الوحدة:
fr: Prix unitaire :

source: Quantity:
ar: الكمية:
fr: Quantité :

source: Item Name:
ar: اسم العنصر:
fr: Nom de l'article :

source: Total Amount:
ar: المبلغ الإجمالي:
fr: Montant total :

# dateAt
source: at
ar: في
fr: à

# tasksAndOrders
source: Tasks & Orders
ar: المهام والطلبات
fr: Tâches et commandes

source: active
ar: نشط
fr: actif

source: Enable Permissions
ar: تفعيل الأذونات
fr: Activer les permissions

# permissionsDescription
source: We use your location to show nearby restaurants and delivery status, and notifications to keep you updated.
ar: نستخدم موقعك لإظهار المطاعم القريبة وحالة التوصيل، والإشعارات لإبقائك على اطلاع.
fr: Nous utilisons votre localisation pour afficher les restaurants à proximité et le statut de livraison, et les notifications pour vous tenir informé.

# locationPermissionTitle
source: Location (While Using the App)
ar: الموقع (أثناء استخدام التطبيق)
fr: Localisation (pendant l'utilisation de l'application)

# locationPermissionSubtitle
source: For maps, nearby results, and live delivery tracking.
ar: للخرائط والنتائج القريبة وتتبع التوصيل المباشر.
fr: Pour les cartes, les résultats à proximité et le suivi de livraison en direct.

# notificationsPermissionTitle
source: Notifications
ar: الإشعارات

# notificationsPermissionSubtitle
source: Get order updates and important alerts.
ar: احصل على تحديثات الطلبات والتنبيهات المهمة.
fr: Recevez les mises à jour de commande et les alertes importantes.

source: Allow All
ar: السماح للكل
fr: Tout autoriser

source: Skip for now
ar: تخطي الآن
fr: Ignorer pour l'instant

source: Become Restaurant Owner
ar: كن مالك مطعم

source: Restaurant Owner Application
ar: طلب مالك مطعم

source: Join Our Restaurant Network!
ar: انضم إلى شبكة المطاعم!

# growYourRestaurantBusiness
source: Grow your restaurant business with Sahla
ar: نمي عملك في المطاعم مع سهلة

# serviceAndBasicInfo
source: Service & Basic Info
ar: الخدمة والمعلومات الأساسية

source: Additional Details
ar: تفاصيل إضافية
fr: Ajouteritional Details

source: Select service
ar: اختر الخدمة

# pleaseSelectService
source: Please select a service
ar: يرجى اختيار خدمة

# pleaseSelectServiceType
source: Please select a service type
ar: يرجى اختيار نوع الخدمة

source: Restaurant Name
ar: اسم المطعم

# restaurantNameRequired
source: Restaurant name is required
ar: اسم المطعم مطلوب

source: Enter restaurant name
ar: أدخل اسم المطعم

source: Please enter restaurant name
ar: يرجى إدخال اسم المطعم

# pleaseEnterValidName
source: Please enter a valid name (2-100 characters)
ar: يرجى إدخال اسم صحيح (2-100 حرف)

source: Restaurant Description
ar: وصف المطعم

source: Enter restaurant description
ar: أدخل وصف المطعم

source: Restaurant Phone
ar: هاتف المطعم

# restaurantPhoneRequired
source: Restaurant phone is required
ar: هاتف المطعم مطلوب

source: Enter restaurant phone
ar: أدخل هاتف المطعم

source: Please enter restaurant phone
ar: يرجى إدخال هاتف المطعم

# pleaseEnterValidPhone
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

source: Restaurant Address
ar: عنوان المطعم
fr: Restaurant Ajouterress

# restaurantAddressRequired
source: Restaurant address is required
ar: عنوان المطعم مطلوب

source: Please select restaurant address
ar: يرجى اختيار عنوان المطعم

# pleaseSelectLocationWithinAlgeria
source: Please select a location within Algeria
ar: يرجى اختيار موقع داخل الجزائر

source: Wilaya
ar: الولاية

# pleaseSelectWilaya
source: Please select a wilaya
ar: يرجى اختيار ولاية

source: Grocery Type
ar: نوع البقالة

# pleaseSelectGroceryType
source: Please select a grocery type
ar: يرجى اختيار نوع البقالة

source: Super Market
ar: سوبر ماركت

# boucherie
source: Butchery
ar: جزارة

# patisserie
source: Pastry Shop
ar: مخبزة

source: Fruits & Vegetables
ar: فواكه وخضروات

source: Bakery
ar: مخبز

source: Seafood
ar: مأكولات بحرية

source: Dairy
ar: ألبان

source: Other
ar: أخرى

source: Logo Upload
ar: رفع الشعار

source: Logo uploaded successfully!
ar: تم رفع الشعار بنجاح!

source: Failed to upload logo
ar: فشل في رفع الشعار

source: Logo removed
ar: تم إزالة الشعار

source: Configure Working Hours
ar: تكوين ساعات العمل

source: Please configure working hours
ar: يرجى تكوين ساعات العمل

source: Please fix working hours conflicts
ar: يرجى إصلاح تعارضات ساعات العمل

source: Social Media (optional)
ar: وسائل التواصل الاجتماعي (اختياري)

source: Facebook
ar: فيسبوك

source: Instagram
ar: إنستغرام

source: TikTok
ar: تيك توك

# pleaseEnterValidUrl
source: Please enter a valid URL
ar: يرجى إدخال رابط صحيح

source: Reach thousands of food lovers
ar: الوصول إلى آلاف محبي الطعام

source: Detailed analytics and insights
ar: تحليلات ورؤى مفصلة

# customerSupport
source: 24/7 customer support
ar: دعم العملاء على مدار الساعة

source: Secure payment processing
ar: معالجة دفع آمنة

source: Delivery partner integration
ar: تكامل شركاء التوصيل
fr: Livraison partner integration

source: Connection restored
ar: تم استعادة الاتصال

source: Please check internet connection
ar: يرجى التحقق من اتصال الإنترنت

source: Restaurant request submitted successfully!
ar: تم إرسال طلب المطعم بنجاح!

source: Failed to submit request
ar: فشل في إرسال الطلب

source: Form restored from previous session
ar: تم استعادة النموذج من الجلسة السابقة

source: Working Hours
ar: ساعات العمل

source: Monday
ar: الاثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

source: Adrar
ar: أدرار

source: Chlef
ar: الشلف

source: Laghouat
ar: الأغواط

source: Oum El Bouaghi
ar: أم البواقي

source: Batna
ar: باتنة

# bejaia
source: Béjaïa
ar: بجاية

source: Biskra
ar: بسكرة

# bechar
source: Béchar
ar: بشار

source: Blida
ar: البليدة

# bouira
source: Bouïra
ar: البويرة

source: Tamanrasset
ar: تمنراست

# tebessa
source: Tébessa
ar: تبسة

source: Tlemcen
ar: تلمسان

source: Tiaret
ar: تيارت

source: Tizi Ouzou
ar: تيزي وزو

source: Algiers
ar: الجزائر

source: Djelfa
ar: الجلفة

source: Jijel
ar: جيجل

# setif
source: Sétif
ar: سطيف

# saida
source: Saïda
ar: سعيدة

source: Skikda
ar: سكيكدة

# sidiBelAbbes
source: Sidi Bel Abbès
ar: سيدي بلعباس

source: Annaba
ar: عنابة

source: Guelma
ar: قالمة

source: Constantine
ar: قسنطينة

# medea
source: Médéa
ar: المدية

source: Mostaganem
ar: مستغانم

source: M'Sila
ar: المسيلة

source: Mascara
ar: معسكر

source: Ouargla
ar: ورقلة

source: Oran
ar: وهران

source: El Bayadh
ar: البيض

source: Illizi
ar: إليزي

# bordjBouArreridj
source: Bordj Bou Arréridj
ar: برج بوعريريج

# boumerdes
source: Boumerdès
ar: بومرداس

source: El Tarf
ar: الطارف

source: Tindouf
ar: تندوف

source: Tissemsilt
ar: تيسمسيلت

source: El Oued
ar: الوادي

source: Khenchela
ar: خنشلة

source: Souk Ahras
ar: سوق أهراس

source: Tipaza
ar: تيبازة

source: Mila
ar: ميلة

# ainDefla
source: Aïn Defla
ar: عين الدفلى

# naama
source: Naâma
ar: النعامة

# ainTemouchent
source: Aïn Témouchent
ar: عين تيموشنت

# ghardaia
source: Ghardaïa
ar: غرداية

source: Relizane
ar: غليزان

source: Timimoun
ar: تيميمون

source: Bordj Badji Mokhtar
ar: برج باجي مختار

source: Ouled Djellal
ar: أولاد جلال

# beniAbbes
source: Béni Abbès
ar: بني عباس

source: In Salah
ar: عين صالح

source: In Guezzam
ar: عين قزام

source: Touggourt
ar: تقرت

source: Djanet
ar: جانت

source: El M'Ghair
ar: المغير

source: El Menia
ar: المنيعة

source: Previous
ar: السابق

source: Next
ar: التالي

source: Submitting...
ar: جاري الإرسال...
fr: Soumettreting...

source: Restaurant Logo
ar: شعار المطعم

source: Tap to add logo
ar: اضغط لإضافة الشعار

source: Upload
ar: رفع

source: Select your wilaya
ar: اختر ولايتك

source: Grocery
ar: بقالة

source: Handyman
ar: حرفي

source: Home Food
ar: طعام منزلي
fr: Accueil Food

# plateNumberRequired
source: Plate Number *
ar: رقم اللوحة *

source: Enter your vehicle plate number
ar: أدخل رقم لوحة المركبة

# validationPlateNumberRequired
source: Please enter your plate number
ar: يرجى إدخال رقم اللوحة

source: Tap to view full size
ar: اضغط لعرض بالحجم الكامل

# onePhoto
source: 1 Photo
ar: صورة واحدة

source: Manage Menu
ar: إدارة القائمة

source: User not authenticated
ar: المستخدم غير مصادق عليه

# noRestaurantFound
source: No restaurant found. Please visit the dashboard first.
ar: لم يتم العثور على مطعم. يرجى زيارة لوحة التحكم أولاً.
fr: Non restaurant found. Please visit the dashboard first.

source: Failed to load menu data
ar: فشل في تحميل بيانات القائمة

source: All Cuisines
ar: جميع المطابخ

source: All Categories
ar: جميع الفئات
fr: All Catégories

source: Name
ar: الاسم

source: Date
ar: التاريخ

source: All Items
ar: جميع العناصر

# noItemsFoundMatchingFilters
source: No items found matching your filters
ar: لم يتم العثور على عناصر تطابق المرشحات الخاصة بك
fr: Non items found matching your filters

source: No menu items yet
ar: لا توجد عناصر قائمة بعد
fr: Non menu items yet

# tapPlusButtonToAddFirstItem
source: Tap the + button to add your first item
ar: اضغط على زر + لإضافة أول عنصر

source: Loading more items...
ar: جاري تحميل المزيد من العناصر...

source: Unavailable
ar: غير متوفر

source: Add Item
ar: إضافة عنصر
fr: Ajouter Item

source: Menu item updated and refreshed
ar: تم تحديث عنصر القائمة وتحديثه

# successfullyHidItem
source: Successfully hid "{itemName}"
ar: تم إخفاء "{itemName}" بنجاح
fr: Succèsfully hid "{itemName}"

# successfullyShowedItem
source: Successfully showed "{itemName}"
ar: تم إظهار "{itemName}" بنجاح
fr: Succèsfully showed "{itemName}"

# failedToUpdateAvailability
source: Failed to update availability for "{itemName}"
ar: فشل في تحديث التوفر لـ "{itemName}"

# errorUpdatingAvailability
source: Error updating availability: {error}
ar: خطأ في تحديث التوفر: {error}
fr: Erreur updating availability: {error}

source: Delete Menu Item
ar: حذف عنصر القائمة
fr: Supprimer Menu Item

# deleteMenuItemConfirmation
source: Are you sure you want to delete "{itemName}"? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد حذف "{itemName}"؟ لا يمكن التراجع عن هذا الإجراء.

# deletingItem
source: Deleting "{itemName}"...
ar: جاري حذف "{itemName}"...

# successfullyDeletedItem
source: Successfully deleted "{itemName}"
ar: تم حذف "{itemName}" بنجاح
fr: Succèsfully deleted "{itemName}"

# failedToDeleteItem
source: Failed to delete "{itemName}"
ar: فشل في حذف "{itemName}"

# errorDeletingItem
source: Error deleting item: {error}
ar: خطأ في حذف العنصر: {error}
fr: Erreur deleting item: {error}

source: Dietary Info
ar: المعلومات الغذائية

source: Spicy
ar: حار

source: Vegetarian
ar: نباتي

source: Traditional
ar: تقليدي

source: Gluten Free
ar: خالي من الجلوتين

source: Description
ar: الوصف

source: Main Ingredients
ar: المكونات الرئيسية
fr: Main Ingrédients

# listMainIngredientsIfNoDescription
source: List main ingredients if no description provided
ar: سرد المكونات الرئيسية إذا لم يتم توفير وصف

source: Add ingredient
ar: إضافة مكون
fr: Ajouter ingredient

# defaultVariant
source: Default
ar: افتراضي

# pricingAndSizes
source: Pricing & Sizes
ar: التسعير والأحجام

# variantsAndPricing
source: Variants & Pricing
ar: الخيارات والتسعير

source: Add New Variant
ar: إضافة خيار جديد
fr: Ajouter New Variant

# createDifferentVersionsOfDish
source: Create different versions of your dish (e.g., Classic, Spicy, Vegetarian)
ar: إنشاء إصدارات مختلفة من طبقك (مثل كلاسيكي، حار، نباتي)

source: Variant name
ar: اسم الخيار

source: Add variant
ar: إضافة خيار
fr: Ajouter variant

# eachVariantCanHaveDifferentSizes
source: Each variant can have different sizes and prices
ar: يمكن أن يكون لكل خيار أحجام وأسعار مختلفة

source: For selected variant
ar: للخيار المحدد

source: Standard
ar: قياسي

source: Dish Supplements
ar: إضافات الطبق

source: Add Supplement
ar: إضافة مكمل
fr: Ajouter Supplement

# supplementExamples
source: Examples: Chidar +50 DA, Extra Cheese +30 DA, Spicy Sauce +20 DA
ar: أمثلة: شيدر +50 دج، جبنة إضافية +30 دج، صلصة حارة +20 دج

source: Available for all variants
ar: متاح لجميع الخيارات
fr: Disponible for all variants

source: Available for
ar: متاح لـ
fr: Disponible for

# addFlavorAndSize
source: Add Flavor & Size
ar: إضافة نكهة وحجم
fr: Ajouter Flavor & Size

source: Available for selected variant
ar: متاح للخيار المحدد
fr: Disponible for selected variant

source: Currently unavailable
ar: غير متوفر حالياً

source: Review {title}
ar: مراجعة {title}
fr: Avis {title}

# reviewMenuItem
source: Menu Item
ar: عنصر القائمة
fr: Article du menu

# reviewRestaurant
source: Restaurant
ar: المطعم

# reviewOrder
source: Order #
ar: الطلب رقم
fr: Commande n°

# reviewMenuItemSubtitle
source: Share your thoughts about this dish
ar: شارك رأيك حول هذا الطبق
fr: Partagez vos pensées sur ce plat

# reviewRestaurantSubtitle
source: How was your experience?
ar: كيف كانت تجربتك؟
fr: Comment était votre expérience ?

# reviewOrderSubtitle
source: Rate your overall order experience
ar: قيّم تجربة طلبك الكاملة
fr: Évaluez votre expérience de commande globale

source: How would you rate it?
ar: كيف تقيّمه؟
fr: Comment le noteriez-vous ?

# ratingPoor
source: Poor
ar: ضعيف
fr: Médiocre

# ratingFair
source: Fair
ar: مقبول
fr: Passable

# ratingGood
source: Good
ar: جيد
fr: Bien

# ratingVeryGood
source: Very Good
ar: جيد جداً
fr: Très bien

# ratingExcellent
source: Excellent
ar: ممتاز

source: Select rating
ar: اختر التقييم
fr: Sélectionner une note

source: Share your experience
ar: شارك تجربتك
fr: Partagez votre expérience

source: Share your experience (optional)
ar: شارك تجربتك (اختياري)
fr: Partagez votre expérience (optionnel)

# tellOthersAboutExperience
source: Tell others about your experience...
ar: أخبر الآخرين عن تجربتك...
fr: Parlez de votre expérience aux autres...

# alsoEnjoying
source: Also enjoying {restaurantName}?
ar: هل استمتعت أيضاً بـ {restaurantName}؟
fr: Vous appréciez aussi {restaurantName} ?

# shareRestaurantExperience
source: Share your restaurant experience
ar: شارك تجربتك في المطعم
fr: Partagez votre expérience du restaurant

# rateOverallService
source: Rate the overall service
ar: قيّم الخدمة بشكل عام
fr: Évaluez le service global

# thankYouForRating
source: Thank you for rating {restaurantName}!
ar: شكراً لتقييمك لـ {restaurantName}!
fr: Merci d'avoir noté {restaurantName} !

source: Add photos
ar: إضافة صور
fr: Ajouter des photos

source: Add photos (optional)
ar: إضافة صور (اختياري)
fr: Ajouter des photos (optionnel)

# addPhotosButton
source: Add Photos
ar: إضافة صور
fr: Ajouter des photos

source: Add More Photos
ar: إضافة المزيد من الصور
fr: Ajouter plus de photos

source: Submit Review
ar: إرسال المراجعة
fr: Soumettre l'avis

source: Restaurant review submitted successfully!
ar: تم إرسال مراجعة المطعم بنجاح!
fr: Avis sur le restaurant soumis avec succès !

# failedToSubmitRestaurantReview
source: Failed to submit restaurant review. Please try again.
ar: فشل إرسال مراجعة المطعم. يرجى المحاولة مرة أخرى.
fr: Échec de la soumission de l'avis sur le restaurant. Veuillez réessayer.

# errorOccurredTryAgain
source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.
fr: Une erreur s'est produite. Veuillez réessayer.

# pleaseSelectValidRating
source: Please select a valid rating
ar: يرجى اختيار تقييم صحيح
fr: Veuillez sélectionner une note valide

source: Menu item not found
ar: لم يتم العثور على عنصر القائمة
fr: Article du menu introuvable

source: Restaurant not found
ar: لم يتم العثور على المطعم
fr: Restaurant introuvable

source: Order not found
ar: لم يتم العثور على الطلب
fr: Commande introuvable

source: Review submitted successfully!
ar: تم إرسال المراجعة بنجاح!
fr: Avis soumis avec succès !

# failedToSubmitReview
source: Failed to submit review. Please try again.
ar: فشل إرسال المراجعة. يرجى المحاولة مرة أخرى.
fr: Échec de l'envoi de l'avis. Veuillez réessayer.

source: Add Review
ar: إضافة مراجعة
fr: Ajouter un avis

source: View all reviews
ar: عرض جميع المراجعات
fr: Voir tous les avis

# reviewsScreenTitle
source: Reviews
ar: المراجعات
fr: Avis

source: No reviews yet
ar: لا توجد مراجعات بعد
fr: Aucun avis pour le moment

source: Be the first to review
ar: كن أول من يراجع
fr: Soyez le premier à donner votre avis

source: Oops!
ar: عذراً!
fr: Oups !

source: Failed to load reviews
ar: فشل في تحميل المراجعات
fr: Échec du chargement des avis

source: All Reviews
ar: جميع المراجعات
fr: Tous les avis

source: Newest
ar: الأحدث
fr: Plus récent

source: Oldest
ar: الأقدم
fr: Plus ancien

source: Highest Rated
ar: الأعلى تقييماً
fr: Mieux noté

source: Lowest Rated
ar: الأقل تقييماً
fr: Moins bien noté

# monthsAgo
source: {count} {plural} ago
ar: منذ {count} {plural}

source: Verified User
ar: مستخدم موثق
fr: Utilisateur vérifié

source: Anonymous User
ar: مستخدم مجهول
fr: Utilisateur anonyme

source: Review for {menuItem}
ar: مراجعة لـ {menuItem}
fr: Avis pour {menuItem}

source: Prep
ar: التحضير
fr: Préparation

source: Closes at
ar: يُغلق على
fr: Fermeture à

source: Opens at
ar: يُفتح على
fr: Ouverture à

source: View Reviews
ar: عرض المراجعات
fr: Voir les avis

source: Min Order
ar: الحد الأدنى
fr: Commande min

# deliveryFeeShort
source: Delivery Fee
ar: رسوم التوصيل
fr: Frais de livraison

source: Avg Delivery Time
ar: متوسط وقت التوصيل
fr: Temps de livraison moyen

source: LIMITED
ar: محدود
fr: Limité

source: EXPIRED
ar: منتهي الصلاحية
fr: Expiré

source: Limited time offers
ar: عروض لفترة محدودة
fr: Offres à durée limitée

source: FREE
ar: مجاني
fr: GRATUIT

source: Removed Ingredients
ar: المكونات المحذوفة
fr: Ingrédients retirés

# itemsLabel
source: Items
ar: العناصر
fr: Articles

source: No items selected
ar: لم يتم اختيار أي عناصر
fr: Aucun article sélectionné

source: Error loading order summary
ar: خطأ في تحميل ملخص الطلب
fr: Erreur lors du chargement du résumé de la commande

# restaurantInfoFormat
source: {deliveryTime} • {minimumOrder} • {city} • {deliveryFee} • {workingHours}
fr: {deliveryTime} • {minimumCommande} • {city} • {deliveryFee} • {workingHours}
